Allows doing things like
```hcl
OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # maas_block_device.metal-1-os["test-metal1-01.sdg"] is tainted, so it must be replaced
-/+ resource "maas_block_device" "metal-1-os" {
      ~ id             = "104" -> (known after apply)
      + model          = (known after apply)
        name           = "sdg"
      ~ path           = "/dev/disk/by-dname/sdg" -> (known after apply)
      + serial         = (known after apply)
        tags           = [
            "os_drive",
        ]
      + uuid           = (known after apply)
        # (5 unchanged attributes hidden)

      ~ partitions {
          ~ path           = "/dev/disk/by-dname/sdg-part2" -> (known after apply)
          - tags           = [] -> null
            # (4 unchanged attributes hidden)
        }
      ~ partitions {
          - bootable       = false -> null
          + mount_point    = "/"
          ~ path           = "/dev/disk/by-dname/sdg-part3" -> (known after apply)
          - tags           = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
╷
│ Warning: Deprecated Resource
│ 
│   with openstack_compute_floatingip_associate_v2.test-chef00_priv,
│   on chef00.tf line 46, in resource "openstack_compute_floatingip_associate_v2" "test-chef00_priv":
│   46: resource "openstack_compute_floatingip_associate_v2" "test-chef00_priv" {
│ 
│ use openstack_networking_floatingip_associate_v2 resource instead
│ 
│ (and 7 more similar warnings elsewhere)
╵

Do you want to perform these actions?
  OpenTofu will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

maas_block_device.metal-1-os["test-metal1-01.sdg"]: Destroying... [id=104]
maas_block_device.metal-1-os["test-metal1-01.sdg"]: Destruction complete after 1s
maas_block_device.metal-1-os["test-metal1-01.sdg"]: Creating...
maas_block_device.metal-1-os["test-metal1-01.sdg"]: Creation complete after 7s [id=105]

Apply complete! Resources: 1 added, 0 changed, 1 destroyed.
```
which previously broke execution flow as "replace" means "destroy" then "create" but TF cannot _create_ disks and NICs from nothing in MaaS nor can it configure devices with other layers atop them when they are gone from MaaS itself.